# FlowConversionMode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePlumbingFixtureFlowData..::..FlowConversionMode Property
PipePlumbingFixtureFlowData Class See Also
---
The flow conversion mode of the pipe.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FlowConversionMode FlowConversionMode { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FlowConversionMode As FlowConversionMode
	Get
```

Visual C++
---
```text
public:
property FlowConversionMode FlowConversionMode {
	FlowConversionMode get ();
}
```

# See Also
PipePlumbingFixtureFlowData Class
Autodesk.Revit.DB.Plumbing Namespace